Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Replaces every subsequence of the input sequence that matches the pattern with the given replacement string.
zh_cn: 替换模式与给定替换字符串相匹配的输入序列的每个子序列。

source: Replaces the first subsequence of the input sequence that matches the pattern with the given replacement string.
zh_cn: 替换模式与给定替换字符串匹配的输入序列的第一个子序列。

source: Reports the end index (exclusive) of this matcher's region.
zh_cn: 报告此匹配器区域的结束索引(不包括)。

source: Reports the start index of this matcher's region.
zh_cn: 报告此匹配器区域的开始索引。

source: Representations of other existing items in the data set are still considered up to date and will not be rebound, though their positions may be altered.
zh_cn: 数据集中其他现有项目的表示仍被认为是最新的，不会被重新绑定，尽管它们的位置可能会改变。

source: Represents a standard bottom navigation bar for application.
zh_cn: 表示应用程序的标准底部导航栏。

source: Represents a standard navigation menu for application.
zh_cn: 表示应用程序的标准导航菜单。

source: Represents files in the files/ subdirectory of your app's internal storage area.
zh_cn: 代表应用程序内部存储区的 files/ 子目录中的文件。

source: Represents files in the cache subdirectory of your app's internal storage area.
zh_cn: 代表应用程序内部存储区的缓存子目录中的文件。

source: Represents the root of the external storage.
zh_cn: 表示外部存储的根目录。

source: Request a fling from a nested scroll.
zh_cn: 从嵌套滚动请求 fling。

source: Requests for a view for a given position may return a reused or rebound scrap view instance.
zh_cn: 对给定位置的 view 的请求可能会返回一个重用或重新绑定的废弃 view 实例。

source: Requests the decoder to subsample the original image, returning a smaller image to save memory.
zh_cn: 请求解码器对原始图像进行二次采样，返回较小的图像以节省内存。

source: Require a Bitmap.Config.HARDWARE Bitmap.
zh_cn: 需要 Bitmap.Config.HARDWARE Bitmap。

source: Requires `app:layout_behavior="@string/appbar_scrolling_view_behavior` to be set on the scrolling sibling (e.g., `NestedScrollView`, `RecyclerView`, etc.).
zh_cn: 需要在滚动的同级上(例如，`NestedScrollView`，`RecyclerView` 等)设置 `app:layout_behavior="@string/appbar_scrolling_view_behavior`。

source: Resets this matcher and then attempts to find the next subsequence of the input sequence that matches the pattern, starting at the specified index.
zh_cn: 重置此匹配器，然后尝试查找匹配该模式、从指定索引开始的输入序列的下一个子序列。

source: Resets this matcher with a new input sequence.
zh_cn: 重置此具有新输入序列的匹配器。

source: Resets this matcher.
zh_cn: 重置匹配器。

source: Resetting a matcher discards its explicit state information and sets the append position to zero.
zh_cn: 重置匹配器将放弃其显式状态信息并将添加位置设置为零。

source: Resource references within attribute values are not resolved
zh_cn: 未解析属性值中的资源引用

source: Respond to CoordinatorLayout touch events after this Behavior has started intercepting them.
zh_cn: 在此行为开始 intercepting 后，响应 CoordinatorLayout 触摸事件。

source: Respond to CoordinatorLayout touch events before they are dispatched to child views.
zh_cn: 在调度到子 view 之前响应 CoordinatorLayout 触摸事件。

source: Respond to a change in a child's dependent view
zh_cn: 响应 child 依赖 view 的变化

source: Respond to a child's dependent view being removed.
zh_cn: 响应 child 依赖 view 的移除。

source: Restore any instance state associated with this adapter and its pages that was previously saved by saveState().
zh_cn: 恢复与此适配器及其先前由 saveState() 保存的页面相关联的任何实例状态。

source: Restricts to ONLY indeterminate mode (state-keeping progress mode will not work).
zh_cn: 限制为仅限于不确定模式(状态保持进度模式将不起作用)。

source: Retains the largest component of the source and destination pixel.
zh_cn: 保留源像素和目标像素的最大分量。

source: Retains the smallest component of the source and destination pixels.
zh_cn: 保留源像素和目标像素的最小分量。

source: Rethrow the exception.
zh_cn: 重新抛出异常。

source: Retire oldest cached view
zh_cn: 停用最旧的缓存 view

source: Retrieve a dimensional for a particular resource ID for use as a size in raw pixels.
zh_cn: 获取特定资源 ID 的尺寸，以用作原始像素的大小。

source: Retrieve a dimensional for a particular resource ID for use as an offset in raw pixels.
zh_cn: 获取特定资源 ID 的尺寸，以用作原始像素中的偏移量。

source: Retrieve a dimensional for a particular resource ID.
zh_cn: 获取特定资源 ID 的尺寸。

source: Retrieve a floating-point value for a particular resource ID.
zh_cn: 获取特定资源 ID 的浮点值。

source: Retrieve a fractional unit for a particular resource ID.
zh_cn: 获取特定资源 ID 的小数单位。

source: Retrieve a set of basic attribute values from an AttributeSet, not performing styling of them using a theme and/or style resources.
zh_cn: 从 AttributeSet 获取一组基本属性值，而不是使用主题和/或样式资源执行它们的样式。

source: Retrieve any offsets for the given item.
zh_cn: 获取指定 item 的偏移。

source: Retrieve attribute values at runtime
zh_cn: 在运行时获取属性值

source: Retrieve the RecyclerView.ViewHolder for the given child view.
zh_cn: 返回给定的子 view 的 RecyclerView.ViewHolder。

source: Retrieve the Source that was interrupted.
zh_cn: 检索已中断的 Source。

source: Retrieve the current height of the ActionBar.
zh_cn: 获取 ActionBar 的当前高度。

source: Retrieve the currently configured content description for the collapse button view.
zh_cn: 获取折叠按钮 view 的当前配置的内容描述。

source: Retrieve the currently configured content description for the navigation button view.
zh_cn: 获取导航按钮 view 的当前配置的内容描述。

source: Retrieve the memory policy for the decoded Bitmap.
zh_cn: 检索已解码的 Bitmap 的内存策略。

source: Retrieve the reason that decoding was interrupted.
zh_cn: 检索解码被中断的原因。

source: Retrieve this RecyclerView's RecyclerView.RecycledViewPool.
zh_cn: 获取 RecyclerView 的 RecyclerView.RecycledViewPool。

source: Retrieve underlying AssetManager storage for these resources.
zh_cn: 获取这些资源的基础 AssetManager 存储。

source: Retrieves the previously set adapter or null if no adapter is set.
zh_cn: 获取之前设置的 adapter，如果没有设置 adapter 则返回 null。

source: Retrieving the Content URI for a File
zh_cn: 为文件获取 content URI

source: Return a boolean associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的布尔值。

source: Return a color-int from alpha, red, green, blue components.
zh_cn: 从 alpha，red，green，blue 组件返回 color-int。

source: Return a color-int from red, green, blue components.
zh_cn: 从红色，绿色，蓝色组件返回 color-int。

source: Return a drawable object associated with a particular resource ID and styled for the specified theme.
zh_cn: 返回与特定资源 ID 关联的可绘制对象，并为指定的主题设置样式。

source: Return a drawable object associated with a particular resource ID for the given screen density in DPI and styled for the specified theme.
zh_cn: 返回与特定资源 ID 关联的可绘制对象，用于 DPI 中给定屏幕密度，并为指定的主题设置样式。

source: Return a global shared Resources object that provides access to only system resources (no application resources), is not configured for the current screen (can not use dimension units, does not change based on orientation, etc), and is not affected by Runtime Resource Overlay.
zh_cn: 返回一个全局共享资源对象，该对象仅提供对系统资源的访问(无应用程序资源)，未为当前屏幕配置(不能使用尺寸单位，不会根据方向更改等)，并且不受运行时资源的影响覆盖。

source: Return a new Context object for the current Context but whose resources are adjusted to match the given Configuration.
zh_cn: 为当前 Context 返回一个新的 Context 对象，但调整其资源以匹配给定的 Configuration。

source: Return a private FragmentManager for placing and managing Fragments inside of this Fragment.
zh_cn: 返回一个私有的 FragmentManager 用于放置及管理在该 Fragment 中的 Fragments。

source: Return a resource identifier for the given resource name.
zh_cn: 返回给定资源名称的资源标识符。

source: Return a unique identifier for the item at the given position.
zh_cn: 返回给定位置的 item 的唯一标识符。

source: Return an XmlResourceParser through which you can read a generic XML resource for the given resource ID.
zh_cn: 返回一个 XmlResourceParser，通过该 XmlResourceParser 可以读取给定资源 ID 的泛型 XML 资源。

source: Return an XmlResourceParser through which you can read a view layout description for the given resource ID.
zh_cn: 返回一个 XmlResourceParser，通过它可以读取给定资源 ID 的 view 布局描述。

source: Return an XmlResourceParser through which you can read an animation description for the given resource ID.
zh_cn: 返回一个 XmlResourceParser，你可以通过它读取给定资源 ID 的动画描述。

source: Return an array of heterogeneous values.
zh_cn: 返回一个异类值数组。

source: Return an integer associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的整数。

source: Return the OnPartialImageListener currently set.
zh_cn: 返回当前设置的 OnPartialImageListener。

source: Return the PostProcessor currently set.
zh_cn: 返回当前设置的 PostProcessor。

source: Return the RecyclerView.LayoutManager currently responsible for layout policy for this RecyclerView.
zh_cn: 返回该 RecyclerView 的当前负责布局策略的 RecyclerView.LayoutManager。

source: Return the Fragment associated with a specified position.
zh_cn: 返回与指定位置相关联的 fragment。

source: Return the FragmentManager for interacting with fragments associated with this fragment's activity.
zh_cn: 返回 FragmentManager，以便于与该 fragment 的 activity 相关联的其他 fragments 进行交互。

source: Return the Menu shown in the toolbar.
zh_cn: 返回工具栏中显示的菜单。

source: Return the Typeface value associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的字体值。

source: Return the ViewHolder for the item in the given position of the data set as of the latest layout pass.
zh_cn: 返回数据中给定位置（最近的布局传递的）对应的 item 的 ViewHolder。

source: Return the ViewHolder for the item in the given position of the data set.
zh_cn: 返回数据集中给定位置对应的 item 的 ViewHolder。

source: Return the ViewHolder for the item with the given id.
zh_cn: 返回指定 id 对应的 item 的 ViewHolder。

source: Return the adapter position that the given child view corresponds to.
zh_cn: 返回给定的子 view 对应的 adapter position。

source: Return the allocator for the pixel memory.
zh_cn: 返回像素内存的分配器。

source: Return the alpha component of a color int.
zh_cn: 返回颜色 int 的 alpha 分量。

source: Return the blue component of a color int.
zh_cn: 返回颜色 int 的蓝色分量。

source: Return the bottom padding of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的底部 padding。

source: Return the child view at the given index
zh_cn: 返回给定 index 位置的子 view。

source: Return the class name of this object to be used for accessibility purposes.
zh_cn: 返回此对象的类名以用于辅助功能。

source: Return the cropping rectangle, if set.
zh_cn: 如果设置，则返回裁剪矩形。

source: Return the current axes of nested scrolling for this NestedScrollingParent.
zh_cn: 返回此 NestedScrollingParent 的嵌套滚动的当前轴。

source: Return the current configuration that is in effect for this resource object.
zh_cn: 返回对此资源对象有效的当前配置。

source: Return the current display metrics that are in effect for this resource object.
zh_cn: 返回对此资源对象有效的当前显示度量。

source: Return the current drawable used as the collapse icon.
zh_cn: 返回当前用作折叠图标的 drawable。

source: Return the current drawable used as the navigation icon.
zh_cn: 返回用作导航图标的当前 drawable。

source: Return the current drawable used as the overflow icon.
zh_cn: 返回当前用作溢出图标的 drawable。

source: Return the current logo drawable.
zh_cn: 返回当前 logo 的 drawable。

source: Return the current number of child views attached to the parent RecyclerView.
zh_cn: 返回当前附加到父 RecyclerView 的子 views 的数量。

source: Return the current scrolling state of the RecyclerView.
zh_cn: 返回 RecyclerView 的当前滚动状态。

source: Return the current vertical offset of the action bar.
zh_cn: 返回操作栏的当前垂直偏移量。

source: Return the description of the toolbar's logo.
zh_cn: 返回工具栏 logo 的说明。

source: Return the end padding of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的 end padding。

source: Return the entry name for a given resource identifier.
zh_cn: 返回给定资源标识符的条目名称。

source: Return the full name for a given resource identifier.
zh_cn: 返回给定资源标识符的全名。

source: Return the green component of a color int.
zh_cn: 返回颜色 int 的绿色组件。

source: Return the height measurement spec mode of the RecyclerView.
zh_cn: 返回 RecyclerView 的高度的 measurement spec mode。

source: Return the height of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的高度。

source: Return the int array associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的 int 数组。

source: Return the left padding of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的左 padding。

source: Return the offset of the RecyclerView's text baseline from the its top boundary.
zh_cn: 返回 RecyclerView 的文字基线，从它的顶部边界。

source: Return the package name for a given resource identifier.
zh_cn: 返回给定资源标识符的包名称。

source: Return the path's fill type.
zh_cn: 返回路径的填充类型。

source: Return the raw data associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的原始数据。

source: Return the red component of a color int.
zh_cn: 返回颜色 int 的红色分量。

source: Return the right padding of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的右 padding。

source: Return the stable ID for the item at position.
zh_cn: 返回位于 position 处的项的稳定的 ID。

source: Return the stable item id that the given child view corresponds to.
zh_cn: 返回给定的子 view 对应的固定的 item id。

source: Return the start padding of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的 start padding。

source: Return the string array associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的字符串数组。

source: Return the string value associated with a particular resource ID, substituting the format arguments as defined in Formatter and String.format(String, Object...).
zh_cn: 返回与特定资源 ID 关联的字符串值，替换 Formatter 和 String.format(String, Object...)。

source: Return the string value associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的字符串值。

source: Return the styled text array associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的样式化文本数组。

source: Return the subtitle of this toolbar.
zh_cn: 返回此工具栏的副标题。

source: Return the top padding of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的顶部 padding。

source: Return the type name for a given resource identifier.
zh_cn: 返回给定资源标识符的类型名称。

source: Return the view type of the item at position for the purposes of view recycling.
zh_cn: 返回位于 position 的项的 view 类型，以便进行 view 回收。

source: Return the width measurement spec mode of the RecyclerView.
zh_cn: 返回 RecyclerView 的宽度的 measurement spec mode。

source: Return the width of the parent RecyclerView
zh_cn: 返回父 RecyclerView 的宽度。

source: Return true if the pressed state should be delayed for children or descendants of this ViewGroup.
zh_cn: 如果应该为此 ViewGroup 的子项或后代延迟按下状态，则返回 true。

source: Return true if the shader has a non-identity local matrix.
zh_cn: 如果 shader 具有非同一的局部矩阵，则返回 true。

source: Return true to steal motion events from the children and have them dispatched to this ViewGroup through onTouchEvent().
zh_cn: 返回 true 以从子节点窃取动作事件，并通过 onTouchEvent() 将它们分派到此 ViewGroup。

source: Return whether the Bitmap will have unpremultiplied pixels.
zh_cn: 返回 Bitmap 是否具有未预乘的像素。

source: Return whether the action bar is configured to scroll out of sight along with a nested scrolling child.
zh_cn: 返回操作栏是否配置为与 nested scrolling child 一起滚动出视线。

source: Return whether the decoded Bitmap will be mutable.
zh_cn: 返回解码的 Bitmap 是否可变。

source: Return whether to treat single channel input as alpha.
zh_cn: 返回是否将单通道输入视为 alpha。

source: Returns
zh_cn: 返回

source: Returns a Context with an appropriate theme for creating views that will appear in the action bar.
zh_cn: 返回带有适当主题的 Context，用于创建将显示在操作栏中的 view。

source: Returns a View that can be binded to the given Adapter position.
zh_cn: 返回可绑定到给定适配器位置的 view。

source: Returns a hash code value for the object.
zh_cn: 返回对象的哈希码值。

source: Returns a literal replacement String for the specified String.
zh_cn: 返回指定 String 的字面值替换 String。

source: Returns a new set of layout parameters based on the supplied attributes set.
zh_cn: 返回一个新的布局参数设置，基于提供的属性设置。

source: Returns a reference to the currently executing thread object.
zh_cn: 返回对当前正在执行的线程对象的引用。

source: Returns a safe set of layout parameters based on the supplied layout params.
zh_cn: 返回一个安全的布局参数，基于提供的布局参数。

source: Returns a set of default layout parameters.
zh_cn: 返回默认的布局参数。

source: Returns a set of layout parameters with a width of ViewGroup.LayoutParams.MATCH_PARENT, and a height of ViewGroup.LayoutParams.MATCH_PARENT.
zh_cn: 返回一组宽度为 ViewGroup.LayoutParams.MATCH_PARENT，高度为 ViewGroup.LayoutParams.MATCH_PARENT 的布局参数。

source: Returns a string representation of the object.
zh_cn: 返回对象的字符串表示形式。

source: Returns a string representation of this annotation.
zh_cn: 返回此注释的字符串表示形式。

source: Returns a themed color integer associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的主题颜色整数。

source: Returns a themed color state list associated with a particular resource ID.
zh_cn: 返回与特定资源 ID 关联的主题颜色状态列表。

source: Returns a view for the position either from attach scrap, hidden children, or cache.
zh_cn: 从附加的废料中、隐藏的子项中、或缓存中，返回指定位置的 view。

source: Returns an Object representing the new page.
zh_cn: 返回表示新页面的对象。

source: Returns an array of stack trace elements representing the stack dump of this thread.
zh_cn: 返回表示此线程的 stack dump 的堆栈跟踪元素数组。

source: Returns an index for which valueAt(int) would return the specified key, or a negative number if no keys map to the specified value.
zh_cn: 返回一个索引，对于该索引，valueAt(int) 将返回指定的键，如果没有键映射到指定的值，则返回负数。

source: Returns how long the scroll event will take, in milliseconds.
zh_cn: 返回 scroll 事件将花费的时间(以毫秒为单位)。

source: Returns offset of the RecyclerView's text baseline from the its top boundary.
zh_cn: 返回 RecyclerView 的文字基线，从它的上边缘。

source: Returns the Interpolator being used for scrolling the view associated with this AppBarLayout.LayoutParams.
zh_cn: 返回 Interpolator，用于滚动与此 AppBarLayout.LayoutParams 相关联的 view。

source: Returns the View type defined by the adapter.
zh_cn: 返回 adapter 定义的 View type。

source: Returns the ViewHolder that contains the given view.
zh_cn: 返回包含给定 view 的 ViewHolder。

source: Returns the absolute value of the current velocity.
zh_cn: 返回当前速度的绝对值。

source: Returns the adapter position of the first completely visible view for each span.
zh_cn: 返回每个跨度内第一个完全可见的 view 的 adapter position。

source: Returns the adapter position of the first visible view for each span.
zh_cn: 返回每个跨度内第一个可见 view 的 adapter position。

source: Returns the adapter position of the item represented by the given View.
zh_cn: 返回由给定 view 展现的 item 对应的 adapter 的位。

source: Returns the adapter position of the last completely visible view for each span.
zh_cn: 返回每个跨度内最后一个完全可见的 view 的 adapter position。

source: Returns the adapter position of the last visible view for each span.
zh_cn: 返回每个跨度内最后一个可见的 view 的 adapter position。

source: Returns the annotation type of this annotation.
zh_cn: 返回该注解的注解类型。

source: Returns the behavior associated with the matching View class.
zh_cn: 返回与匹配的 View 类关联的行为。

source: Returns the bottom edge of the given child view within its parent, offset by any applied ItemDecorations.
zh_cn: 返回给定的子 view 在父 view 中底边，由应用的任何的 ItemDecorations 偏移。

source: Returns the bounds of the view including its decoration and margins.
zh_cn: 返回 view 的边界，包含它的装饰及 margins。

source: Returns the character sequence necessary for grammatically correct pluralization of the given resource ID for the given quantity.
zh_cn: 返回给定数量的给定资源 ID 的语法正确复数化所需的字符序列。

source: Returns the current ActionBar subtitle in standard mode.
zh_cn: 以标准模式返回当前的操作栏副标题。

source: Returns the current ActionBar title in standard mode.
zh_cn: 以标准模式返回当前的 ActionBar 标题。

source: Returns the current X offset in the scroll.
zh_cn: 返回滚动中的当前 X 偏移量。

source: Returns the current Y offset in the scroll.
zh_cn: 返回滚动中的当前 Y 偏移量。

source: Returns the current gap handling strategy for StaggeredGridLayoutManager.
zh_cn: 返回 StaggeredGridLayoutManager 当前处理间隙的策略。

source: Returns the current velocity.
zh_cn: 返回当前速度。

source: Returns the drawable which is used for the status bar foreground.
zh_cn: 返回用于状态栏前景的 drawable。

source: Returns the final span index of the provided position.
zh_cn: 返回所提供的位置的 span index。

source: Returns the hash code of this annotation, as defined below:
zh_cn: 返回该注解的哈希码，定义如下：

source: Returns the id of the view that the AppBarLayout should use to determine whether it should be lifted.
zh_cn: 返回 AppBarLayout 应该用于确定是否应该提升的 view 的 id。

source: Returns the index for which keyAt(int) would return the specified key, or a negative number if the specified key is not mapped.
zh_cn: 返回一个索引，对于该索引，keyAt(int) 将返回指定键，如果未映射指定键，则返回负数。

source: Returns the index of the child to draw for this iteration.
zh_cn: 返回迭代中子 view 的绘制顺序。

source: Returns the index of the group this position belongs.
zh_cn: 返回该 adapter 位置对应的 item 处于 group 中的 index。

source: Returns the input subsequence captured by the given group during the previous match operation.
zh_cn: 返回在以前匹配操作期间由给定组捕获的输入子序列。

source: Returns the input subsequence matched by the previous match.
zh_cn: 返回由以前匹配所匹配的输入子序列。

source: Returns the item View which has or contains focus.
zh_cn: 返回拥用或包含焦点的 item view。

source: Returns the left edge of the given child view within its parent, offset by any applied ItemDecorations.
zh_cn: 返回给定的子 view 的左边，偏移自任何应用的 ItemDecorations。

source: Returns the list of views which depend on the provided view.
zh_cn: 返回依赖于提供的 view 的 view 列表。

source: Returns the list of views which the provided view depends on.
zh_cn: 返回提供的 view 所依赖的 view 列表。

source: Returns the maximum fling velocity used by this RecyclerView.
zh_cn: 返回该 RecyclerView 的最大的 fling 速度。

source: Returns the measured height of the given child, plus the additional size of any insets applied by ItemDecorations.
zh_cn: 返回给定子 view 的 measured height，加上应用的 ItemDecorations 的内缩值。

source: Returns the measured width of the given child, plus the additional size of any insets applied by ItemDecorations.
zh_cn: 返回给定子 view 的 measured width，加上应用的 ItemDecorations 的内缩值。

source: Returns the minimum velocity to start a fling.
zh_cn: 返回开始 fling 的最小速度。

source: Returns the number of capturing groups in this match result's pattern.
zh_cn: 返回此匹配结果的模式中的捕获组数。

source: Returns the number of capturing groups in this matcher's pattern.
zh_cn: 返回此匹配器模式中的捕获组数。

source: Returns the number of items in the adapter bound to the parent RecyclerView.
zh_cn: 返回父 RecyclerView 绑定的 adapter 的 item 数量。

source: Returns the number of key-value mappings that this SparseArray currently stores.
zh_cn: 返回此 SparseArray 当前存储的键值映射数。

source: Returns the number of span occupied by the item at position.
zh_cn: 返回在 position 位置的 item 所占据的 span 数量。

source: Returns the offset after the last character matched.
zh_cn: 返回最后匹配字符之后的偏移量。

source: Returns the offset after the last character of the subsequence captured by the given group during the previous match operation.
zh_cn: 返回在以前的匹配操作期间，由给定组所捕获子序列的最后字符之后的偏移量。

source: Returns the offset after the last character of the subsequence captured by the given group during this match.
zh_cn: 返回在匹配期间由给定组所捕获子序列的最后字符之后的偏移量。

source: Returns the original image's height
zh_cn: 返回原始图像的高度

source: Returns the original image's width
zh_cn: 返回原始图像的宽度

source: Returns the parallax scroll multiplier used in conjunction with COLLAPSE_MODE_PARALLAX.
zh_cn: 返回与 COLLAPSE_MODE_PARALLAX 一起使用的视差滚动乘数。

source: Returns the path's convexity, as defined by the content of the path.
zh_cn: 返回路径内容定义的路径凸度。

source: Returns the pattern that is interpreted by this matcher.
zh_cn: 返回由此匹配器解释的模式。

source: Returns the relative luminance of a color.
zh_cn: 返回颜色的相对亮度。

source: Returns the requested collapse mode.
zh_cn: 返回请求的折叠模式。

source: Returns the resolved layout direction for this RecyclerView.
zh_cn: 返回 RecyclerView 决定的布局方向。

source: Returns the resource ID of the resource that was used to create this AttributeSet.
zh_cn: 返回用于创建此 AttributeSet 的资源的资源 ID。

source: Returns the right edge of the given child view within its parent, offset by any applied ItemDecorations.
zh_cn: 返回给定子 view 的右边，偏移自应用的 ItemDecorations。

source: Returns the runtime class of this Object.
zh_cn: 返回此 Object 的运行时类。

source: Returns the scroll range of all children.
zh_cn: 返回所有子项的滚动范围。

source: Returns the scrolling flags.
zh_cn: 返回滚动标志。

source: Returns the start X offset in the scroll.
zh_cn: 返回滚动中的起始 X 偏移量。

source: Returns the start Y offset in the scroll.
zh_cn: 返回滚动中的起始 Y 偏移量。

source: Returns the start index of the match.
zh_cn: 返回匹配的初始索引。

source: Returns the start index of the previous match.
zh_cn: 返回以前匹配的初始索引。

source: Returns the start index of the subsequence captured by the given group during the previous match operation.
zh_cn: 返回在以前的匹配操作期间，由给定组所捕获的子序列的初始索引。

source: Returns the start index of the subsequence captured by the given group during this match.
zh_cn: 返回在匹配期间由给定组捕获的子序列的初始索引。
